In [2]:
import numpy as np
import pandas as pd

# $pd.Series$

In [3]:
labels = ['a', 'b', 'c', 'd']
values = [10, 20, 30, 40]

nvalues = np.array([50, 60, 70, 80, 100])

d = {'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [8]:
pd.Series(values)

0    10
1    20
2    30
3    40
dtype: int64

In [9]:
pd.Series(data=values, index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [10]:
pd.Series(nvalues)

0     50
1     60
2     70
3     80
4    100
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

### Operations

In [12]:
seriesQ1 = pd.Series(data=[400, 560, 340, 450], index=['USA', 'UK', 'China', 'Australia'])
seriesQ1

USA          400
UK           560
China        340
Australia    450
dtype: int64

In [14]:
seriesQ2 = pd.Series(data = [200, 378, 340, 340], index=['USA', 'UK', 'Singapore', 'Australia'])
seriesQ2

USA          200
UK           378
Singapore    340
Australia    340
dtype: int64

In [18]:
seriesQ1 + seriesQ2

Australia    790.0
China          NaN
Singapore      NaN
UK           938.0
USA          600.0
dtype: float64

# $pd.DataFrame$

In [19]:
columns = ['W', 'X', 'Y', 'Z']

In [20]:
indexes = ['A', 'B', 'C', 'D', 'E']

In [21]:
from numpy.random import randint

In [23]:
np.random.seed(42)
data = randint(-100, 100, (5, 4))

data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [24]:
df = pd.DataFrame(data=data, index=indexes, columns=columns)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

### Access Columns

In [32]:
col = df['W'] 
col

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [107]:
col = df.W

In [33]:
frame = df[['W', 'X']] # Double bracket hence pass the a list of columns.
frame

    W   X
A   2  79
B   6 -29
C   2  21
D  16  -1
E  30  49

In [108]:
type(col), type(frame)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

##### Feature Engineering

In [35]:
df['new'] = df['W'] + df['Y']

In [36]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

##### Drop Columns

In [40]:
df = df.drop('new', axis=1) # Should define axis as the default axis is 0 (rows).

In [41]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

### Access Rows (Indexes)
#### By Name

In [42]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [44]:
df.loc[['A', 'C']]

   W   X   Y   Z
A  2  79  -8 -86
C  2  21 -26 -13

#### By Index

In [46]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [48]:
df.iloc[1:, :]

    W   X   Y   Z
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [49]:
df.iloc[-1] # Last Row

W    30
X    49
Y   -48
Z   -99
Name: E, dtype: int64

### Drop Rows

In [56]:
df.drop('A') # This is not inplace. Should re-assign to take effect.

    W   X   Y   Z
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

### Access Columns and Rows Together

In [52]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [50]:
df.loc['A', 'W']

2

In [51]:
df.loc[['A', 'C'], 'X']

A    79
C    21
Name: X, dtype: int64

In [54]:
df.loc[['B', 'D'], ['X', 'Z']]

    X   Z
B -29 -80
D  -1  51

## Conditional Operations

In [57]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [58]:
df[df > 0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

### Filter Base on the Single Column Values

In [59]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

**Get the values where `X` columns `values > 0`**

In [61]:
X = df[df['X'] > 0] # Also a pd.DataFrame

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [62]:
df[df['X'] > 0].iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [67]:
df[df['X'] > 0].loc[['A', 'C'], ['W', 'Z']]

   W   Z
A  2 -86
C  2 -13

### Filter Base on the Multiple Conditions

In [76]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [81]:
(df['W'] > 0) & (df['Y'] > 0)

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [80]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

# $df.query()$

In [114]:
df.query('W > X') # Equivalent to df['W'] > df['X']

         W   X   Y   Z
States
NY       6 -29  88 -80
OR      16  -1   3  51

## Reset Index

In [94]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

### Set Existing Column as Index

In [95]:
new_index = ['CO', 'NY', 'WY', 'OR', 'CA']

In [110]:
df['States'] = new_index

In [97]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CO
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CA

In [111]:
df = df.set_index('States')

In [112]:
df # .columns

         W   X   Y   Z
States
CO       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CA      30  49 -48 -99

# Extras - Way to Access Columns

In [116]:
df.W

States
CO     2
NY     6
WY     2
OR    16
CA    30
Name: W, dtype: int64

In [117]:
df.W > df.Y

States
CO     True
NY    False
WY     True
OR     True
CA     True
dtype: bool

In [118]:
df[df.W > df.Y]

         W   X   Y   Z
States
CO       2  79  -8 -86
WY       2  21 -26 -13
OR      16  -1   3  51
CA      30  49 -48 -99

# $df.describe()$

In [119]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

# $df.info()$

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CO to CA
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 372.0+ bytes

# $df.dtypes$

In [121]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object

# Missing Data

In [122]:
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, np.nan, 80],
    'C': [10, 20, 30 ,40]
})

In [123]:
df

     A     B   C
0  1.0   5.0  10
1  2.0   NaN  20
2  NaN   NaN  30
3  4.0  80.0  40

## $df.dropna()$

In [124]:
df.dropna() # Default axis = 0

     A     B   C
0  1.0   5.0  10
3  4.0  80.0  40

In [125]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [129]:
df.dropna(thresh=3)

     A     B   C
0  1.0   5.0  10
3  4.0  80.0  40

In [134]:
df.dropna(axis=1, thresh=2)

     A     B   C
0  1.0   5.0  10
1  2.0   NaN  20
2  NaN   NaN  30
3  4.0  80.0  40

## $df.fillna()$

In [135]:
df

     A     B   C
0  1.0   5.0  10
1  2.0   NaN  20
2  NaN   NaN  30
3  4.0  80.0  40

In [136]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       2 non-null      float64
 2   C       4 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

In [137]:
df.dtypes

A    float64
B    float64
C      int64
dtype: object

In [142]:
df.fillna(value="Fill NaN")

          A         B   C
0       1.0       5.0  10
1       2.0  Fill NaN  20
2  Fill NaN  Fill NaN  30
3       4.0      80.0  40

In [139]:
df.fillna(0)

     A     B   C
0  1.0   5.0  10
1  2.0   0.0  20
2  0.0   0.0  30
3  4.0  80.0  40

#### `df.fillna()` Single Column

In [144]:
df['A'] = df['A'].fillna(0)

In [145]:
df

     A     B   C
0  1.0   5.0  10
1  2.0   NaN  20
2  0.0   NaN  30
3  4.0  80.0  40

#### `df.fillna()` with Average of the Column

In [147]:
df['B'].fillna(df['B'].mean())

0     5.0
1    42.5
2    42.5
3    80.0
Name: B, dtype: float64

In [150]:
df = df.fillna(df.mean())

In [151]:
df

     A     B   C
0  1.0   5.0  10
1  2.0  42.5  20
2  0.0  42.5  30
3  4.0  80.0  40

# Group By Operations (Similar to SQL `GROUP BY`) - `groupBy` and `aggregate`

In [153]:
df = pd.read_csv('../notebooks/01-Pandas-Crash-Course/Universities.csv')

In [155]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [160]:
group = df[['Year', 'Completions']].groupby('Year').sum()
group

      Completions
Year
2012        20333
2013        21046
2014        24730
2015        26279
2016        26224

In [161]:
group.sort_index(ascending=False)

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

## Group By Multiple Columns (Multi-Tier Group By)

In [162]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [168]:
df[['Year', 'Sector', 'Completions']].groupby(['Year', 'Sector']).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

### OR use `describe()`

In [172]:
desc = df[['Year', 'Completions']].groupby('Year').describe()
desc

     Completions
           count        mean          std   min     25%    50%     75%     max
Year
2012        38.0  535.078947  1036.433239  13.0  114.25  229.5  420.50  5388.0
2013        40.0  526.150000  1040.474782   0.0   98.50  189.0  413.00  5278.0
2014        42.0  588.809524  1150.355857   0.0  104.50  203.5  371.75  5093.0
2015        44.0  597.250000  1183.371791   0.0   87.75  191.0  405.75  5335.0
2016        43.0  609.860465  1235.952796   0.0   90.00  208.0  414.00  5367.0

In [173]:
desc.transpose()

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

# Pandas Operations

In [174]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [175]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [176]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [177]:
df_one['k1'].nunique()

3

In [178]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [179]:
df_one.value_counts()

k1  col1  col2
B   300   WA      2
A   100   NY      1
    200   CA      1
C   400   AK      1
    500   NV      1
dtype: int64

### $pd.Series.apply()$

In [183]:
df_one['NEW'] = df_one['col1'] * 10
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [184]:
def grab_first_letter(state):
    return state[0]

In [187]:
df_one['first_letter'] = df_one['col2'].apply(grab_first_letter)
df_one

  k1  col1 col2   NEW first_letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [188]:
def complex_letter(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [189]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

### $pd.Series.map()$

In [190]:
df_one.k1

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [192]:
mymap = {'A': 1, 'B': 2, 'C': 3}
mymap

{'A': 1, 'B': 2, 'C': 3}

In [193]:
df_one.k1.map(mymap)

0    1
1    1
2    2
3    2
4    3
5    3
Name: k1, dtype: int64

In [196]:
df_one['new'] = df_one.k1.map(mymap)
df_one

  k1  col1 col2   NEW first_letter  new
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

### `pd.Series.min()`, `pd.Series.max()`, `pd.Series.idxmin()` and `pd.Series.idxmax()`

In [197]:
df_one.col1.min()

100

In [198]:
df_one.col1.idxmin()

0

In [202]:
df_one.NEW.max()

5000

In [204]:
df_one.NEW.idxmax()

5

### `pd.DataFrame.max()` and `pd.DataFrame.min()`

In [205]:
df_one.max()

k1                 C
col1             500
col2              WA
NEW             5000
first_letter       W
new                3
dtype: object

In [207]:
df_one.min()

k1                 A
col1             100
col2              AK
NEW             1000
first_letter       A
new                1
dtype: object

## Set Columns of DataFrame

In [208]:
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW', 'first_letter', 'new'], dtype='object')

In [212]:
df_one.columns = ['C1', 'C2', 'C3', 'C4', 'C5', 'C6'] # Keep mind the lenght of list to be as same as the original column count.
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

## Sorting the DataFrame

In [222]:
df_one.sort_values('C3', ascending=False)

  C1   C2  C3    C4 C5  C6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

## Concatenating DataFrames

In [223]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [224]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [225]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [226]:
pd.concat([features, predictions]) # Deafult axis is 0 (rows)

       A     B  pred
0  100.0  12.0   NaN
1  200.0  13.0   NaN
2  300.0  14.0   NaN
3  400.0  15.0   NaN
4  500.0  16.0   NaN
0    NaN   NaN   0.0
1    NaN   NaN   1.0
2    NaN   NaN   1.0
3    NaN   NaN   0.0
4    NaN   NaN   1.0

In [227]:
pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

## Creating Dummy Variables

In [228]:
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [229]:
df_one['C1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: C1, dtype: object

In [231]:
pd.get_dummies(df_one.C1) # One-Hot Encoding

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

# Data Input and Output